{
  "active": true,
  "title": "Algorithm R&D Engineer",
  "date": "2019-09-02T19:40:30.704Z",
  "description": "You’ll take full ownership in developing our core models and algorithms from the ground up in a supportive, inclusive, cross-functional team.",
  "body": "At Circuit Mind we are completely automating the design of electronic circuit boards.\n\nElectronic circuit boards are at the core of current and future inventions, from augmented reality to autonomous vehicles. Yet today, designing an electronic circuit board is an extremely manual, long and tedious process. At Circuit Mind we are on a mission to solve this problem, shaping the future of hardware design.\n\nTaking inspiration from integrated circuit design, where high-level languages are used to automatically create complex circuits in silicon, we are building a novel software system that creates finished circuit board designs from high-level requirements. We are tackling hard problems that no one has ever solved before, pushing beyond what is currently thought to be possible.\n\nSeveral small and large engineering companies are waiting for Circuit Mind’s technology. We have the backing of world-class VC investors and we are building a tight-knit interdisciplinary team with outstanding technical abilities in electronic engineering, software engineering and algorithm design.\n\nWe are looking for humble perpetual learners who are driven and able to think critically to play a major role in shaping Circuit Mind from the beginning.\n\n## Position: Algorithm R&D Engineer\nAs an Algorithm R&D Engineer at Circuit Mind, you’ll take full ownership in developing our core models and algorithms from the ground up in a supportive, inclusive, cross-functional team.\n\n## Responsibilities\n- Problem definition: You will intimately understand the real-world electronic design problems to solve, through collaboration with the electronics engineering team.\n- Research: You will look into well-established and state of the art techniques that can be applied to solve the problems.\n- Development: You will devise descriptive models and efficient algorithms that find efficient solutions to real world electronics design problems.\n- Implementation: You will collaborate with the software development team to implement the models and algorithms developed in robust, scalable and efficient software.\n\n\nSome electronics design problems you will solve:\n\n- Generation of alternative design architectures based on user requirements.\n- Selection of electronic components from millions of alternatives.\n- Validation and optimisation of the logical and electrical configuration of circuit schematics via simulations and design rules.\n- Creation of three-dimensional placement and routing of electronic components.\n\n## Qualifications\n- PhD in computer science, applied maths, electrical engineering or related fields, or Master's and 3+ years experience in developing research-led software.\n- Deep expertise with 2-3 of the following: discrete optimisation, data-driven optimisation, machine learning techniques, high-performance computing, mathematical modelling, data structures, algorithms on graphs.\n- Ability to write, understand and debug clean, maintainable software code.\n- Familiarity with electronics engineering.\n\n## Nice to haves\n- Prior experience in solving some of the problems of automatic circuit board design.\n- Experience developing and deploying production ready software.\n- Working knowledge of machine learning and data science concepts, environment and tools.\n\n## Benefits\n- Technical challenges and the chance to shape first-hand the electronics revolution.\n- Collaboration with world-class multi-disciplinary team.\n- Competitive salary and equity.\n- 25 days of annual holidays\n- Flexible working environment.\n- London Bridge office.\n\nAt Circuit Mind we value diversity and foster an inclusive environment. If you have an additional necessity or disability that requires accommodation, please let us know so we can adjust the interview process to your needs. We also ensure that Circuit Mind’s straight-forward and efficient hiring process honours your time.\n\n"
}