{
  "active": true,
  "title": "Senior Software Engineer",
  "date": "2019-09-02T16:05:27.976Z",
  "description": "You’ll take full ownership in developing our algorithms and software from the   ground up, while collaborating on a technically challenging product in a   supportive, inclusive, cross-functional team.",
  "body": "At Circuit Mind we are completely automating the design of electronic circuit boards. Just as the introduction of software compilers and interpreters enabled an explosion in software application development, our intelligent software will power complex hardware design and development in the future.\n\nElectronic circuit boards are at the core of current and future inventions, from augmented reality to autonomous vehicles. Yet today, designing an electronic circuit board is an extremely manual, long and tedious process. At Circuit Mind we are on a mission to solve this problem, shaping the future of hardware design.\n\nBy building a novel software system that creates finished circuit board designs from high-level requirements, we are tackling hard problems that no one has ever solved before, pushing beyond what is currently thought to be possible.\n\nSeveral small and large engineering companies are waiting for Circuit Mind’s technology. We have the backing of world-class VC investors and we are building a tight-knit interdisciplinary team with outstanding technical abilities in electronic engineering, software engineering and algorithm design. \n\nWe are looking for humble perpetual learners who are driven and able to think critically to play a major role in shaping Circuit Mind from the beginning.\n\n## Position: Senior Software Engineer\n\nAs a Senior Software Engineer at Circuit Mind, you’ll take full ownership in developing our algorithms and software from the ground up, while collaborating on a technically challenging product in a supportive, inclusive, cross-functional team.\n\n## Responsibilities\n\n- Design, build and maintain Circuit Mind’s core software. This includes a large database of electronic components, complex algorithms for optimisation and generative design, as well as simulation, verification, integration with third-party software and APIs.\n- Design and implement algorithms to solve the problems involved in electronics design in collaboration with the electronics engineering team.\n- Participate in a culture of code reviews, automatic testing and continuous integration.\n- Learn, use, and improve best practices and processes for high-quality software development.\n- Help shape our technology stack, assuring a modern and positive development experience.\n- Help build an amazing engineering team by contributing to our hiring process and participating in interviews and evaluating candidates.\n- Challenge and influence our business and technology strategy.\n\n\nWe’d also love you to inform, iterate and challenge the business and technology strategy, and to actively contribute to hiring the rest of the Circuit Mind engineering team.\n\n## Qualifications\n\n- Bachelor's degree in computer science, software engineering, physics, mathematics or equivalent professional experience.\n\n- Extensive professional experience solving complex problems using Python.\n- Professional experience with automated testing and maintaining large codebases in Python.\n- Experience working in an agile software development environment.\n- An interest in electronic engineering.\n\nWe’re specifically looking for engineers with expertise in the techniques and technologies needed to solve our numerous technical challenges, including but not limited to:\n\n- Algorithm design (high-performance computing, mathematical modelling and discrete optimisation, data science and machine learning)\n- Compiler and programming language design, especially hardware description languages.\n- Information retrieval techniques.\n\n## Benefits\n\n- Technical challenges and the chance to shape first-hand the electronics revolution.\n- Collaboration with world-class multi-disciplinary team.\n- Competitive salary and equity.\n- 25 days of annual holidays.\n- Flexible working environment.\n- London Bridge office.\n\nAt Circuit Mind we value diversity and foster an inclusive environment. If you have an additional necessity or disability that requires accommodation, please let us know so we can adjust the interview process to your needs. We also ensure that Circuit Mind’s straight-forward and efficient hiring process honours your time.\n"
}